In [1]:
import pandas as pd
import numpy as np

series

In [2]:
counts=pd.Series([50,60,70,80])
counts

0    50
1    60
2    70
3    80
dtype: int64

In [3]:
counts.values

array([50, 60, 70, 80])

In [4]:
counts.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
cars=pd.Series([50,60,70] ,index=['audi','benz','bmw'])
cars

audi    50
benz    60
bmw     70
dtype: int64

In [6]:
cars['bmw']

70

In [7]:
cars[2]

70

In [8]:
cars.name='counts'
cars.index.name='model'
cars

model
audi    50
benz    60
bmw     70
Name: counts, dtype: int64

In [9]:
 np.log(cars)

model
audi    3.912023
benz    4.094345
bmw     4.248495
Name: counts, dtype: float64

In [10]:
cars[cars > 60]

model
bmw    70
Name: counts, dtype: int64

In [11]:
cars_dict={'bmw':800,'audi':900,'benz':100}
print(cars_dict)
pd.Series(cars_dict)

{'bmw': 800, 'audi': 900, 'benz': 100}

bmw     800
audi    900
benz    100
dtype: int64

In [12]:
car={"model":['bmw','audi','benz','sokda'],"built_year":[2012,2013,2014,2012],"mileage":[15,12,10,20]}
print(car)
car=pd.DataFrame(car)
car

{'model': ['bmw', 'audi', 'benz', 'sokda'], 'built_year': [2012, 2013, 2014, 2012], 'mileage': [15, 12, 10, 20]}

   model  built_year  mileage
0    bmw        2012       15
1   audi        2013       12
2   benz        2014       10
3  sokda        2012       20

In [13]:
pd.DataFrame(car)

   model  built_year  mileage
0    bmw        2012       15
1   audi        2013       12
2   benz        2014       10
3  sokda        2012       20

In [14]:
df=pd.DataFrame(car,columns=['built_year','mileage','model'])
df

   built_year  mileage  model
0        2012       15    bmw
1        2013       12   audi
2        2014       10   benz
3        2012       20  sokda

In [15]:
df['non']=df.built_year/df.mileage
df

   built_year  mileage  model         non
0        2012       15    bmw  134.133333
1        2013       12   audi  167.750000
2        2014       10   benz  201.400000
3        2012       20  sokda  100.600000

In [16]:
df['series_aligned']=pd.Series(range(5),index=[0,1,2,3,4])
df

   built_year  mileage  model         non  series_aligned
0        2012       15    bmw  134.133333               0
1        2013       12   audi  167.750000               1
2        2014       10   benz  201.400000               2
3        2012       20  sokda  100.600000               3

In [17]:
df.to_dict()

{'built_year': {0: 2012, 1: 2013, 2: 2014, 3: 2012},
 'mileage': {0: 15, 1: 12, 2: 10, 3: 20},
 'model': {0: 'bmw', 1: 'audi', 2: 'benz', 3: 'sokda'},
 'non': {0: 134.13333333333333, 1: 167.75, 2: 201.4, 3: 100.6},
 'series_aligned': {0: 0, 1: 1, 2: 2, 3: 3}}

In [18]:
pd.DataFrame(df.to_dict())

   built_year  mileage  model         non  series_aligned
0        2012       15    bmw  134.133333               0
1        2013       12   audi  167.750000               1
2        2014       10   benz  201.400000               2
3        2012       20  sokda  100.600000               3

In [19]:
data = [{'a': i, 'b':10* i}for i in range(6)]
print(data)
pd.DataFrame(data)

[{'a': 0, 'b': 0}, {'a': 1, 'b': 10}, {'a': 2, 'b': 20}, {'a': 3, 'b': 30}, {'a': 4, 'b': 40}, {'a': 5, 'b': 50}]

   a   b
0  0   0
1  1  10
2  2  20
3  3  30
4  4  40
5  5  50

In [20]:
pd.DataFrame([{'aa': 1, 'bb': 2}, {'bb': 3, 'cc': 6}])

    aa  bb   cc
0  1.0   2  NaN
1  NaN   3  6.0

In [21]:
pd.DataFrame(np.random.randint(2,12),columns=['foo','bar'],index=['a','b','c'])

   foo  bar
a    6    6
b    6    6
c    6    6

In [22]:
pd.DataFrame(np.random.randint(12),columns=['foo','bar'],index=['a','b','c'])

   foo  bar
a    0    0
b    0    0
c    0    0

In [23]:
pd.DataFrame(np.random.randint(12),columns=['foo','bar'],index=['a'])

   foo  bar
a    0    0

In [24]:
a = pd.Index([32,5,46,64,76])
a

Int64Index([32, 5, 46, 64, 76], dtype='int64')

In [25]:
a[1]

5

In [26]:
a[3]

64

In [27]:
a[::]

Int64Index([32, 5, 46, 64, 76], dtype='int64')

In [28]:
a[2:4:1]

Int64Index([46, 64], dtype='int64')

In [29]:
a[:]

Int64Index([32, 5, 46, 64, 76], dtype='int64')

In [30]:
print(a.size,a.shape,a.ndim,a.dtype)

5 (5,) 1 int64

In [31]:
a=np.random.RandomState(10)
b=pd.Series(a.randint(0,10,20))
b

0     9
1     4
2     0
3     1
4     9
5     0
6     1
7     8
8     9
9     0
10    8
11    6
12    4
13    3
14    0
15    4
16    6
17    8
18    1
19    8
dtype: int64

In [32]:
df=pd.DataFrame(a.randint(0,10,(5,4)),columns=['a','b','c','d'])
df

   a  b  c  d
0  4  1  3  6
1  5  3  9  6
2  9  1  9  4
3  2  6  7  8
4  8  9  2  0

In [33]:
np.exp(b)

0     8103.083928
1       54.598150
2        1.000000
3        2.718282
4     8103.083928
5        1.000000
6        2.718282
7     2980.957987
8     8103.083928
9        1.000000
10    2980.957987
11     403.428793
12      54.598150
13      20.085537
14       1.000000
15      54.598150
16     403.428793
17    2980.957987
18       2.718282
19    2980.957987
dtype: float64

In [34]:
np.sin(df*np.pi/4)

              a         b         c             d
0  1.224647e-16  0.707107  0.707107 -1.000000e+00
1 -7.071068e-01  0.707107  0.707107 -1.000000e+00
2  7.071068e-01  0.707107  0.707107  1.224647e-16
3  1.000000e+00 -1.000000 -0.707107 -2.449294e-16
4 -2.449294e-16  0.707107  1.000000  0.000000e+00

 Universal function

In [35]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,'New York': 19651127}, name='population')
print(area)

population

Alaska        1723337
Texas          695662
California     423967
Name: area, dtype: int64

California    38332521
Texas         26448193
New York      19651127
Name: population, dtype: int64

In [36]:
population/area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [37]:
area = pd.Series({'karnataka': 1723337, 'Delhi': 695662,'UP': 423967}, name='state')
population = pd.Series({'Karnataka': 38332521, 'maharstha': 26448193,'Delhi': 19651127}, name='population')
print(area)

karnataka    1723337
Delhi         695662
UP            423967
Name: state, dtype: int64

In [38]:
population/area

Delhi        28.248096
Karnataka          NaN
UP                 NaN
karnataka          NaN
maharstha          NaN
dtype: float64

In [39]:
area.index|population.index

Index(['Delhi', 'Karnataka', 'UP', 'karnataka', 'maharstha'], dtype='object')

In [40]:
a=pd.Series([32,43,53,54],index=[0,1,2,3])
b=pd.Series([21,34,56,75],index=[1,2,3,4])
print(a)
print(b)
a+b

0    32
1    43
2    53
3    54
dtype: int64
1    21
2    34
3    56
4    75
dtype: int64

0      NaN
1     64.0
2     87.0
3    110.0
4      NaN
dtype: float64

In [41]:
a.add(b,fill_value=0)

0     32.0
1     64.0
2     87.0
3    110.0
4     75.0
dtype: float64

In [42]:
df

   a  b  c  d
0  4  1  3  6
1  5  3  9  6
2  9  1  9  4
3  2  6  7  8
4  8  9  2  0

In [43]:
df2=pd.DataFrame({'area':['Karnataka','UP','Delhi'],'population':[700000,60000,50000]})
df2

        area  population
0  Karnataka      700000
1         UP       60000
2      Delhi       50000

In [44]:
data = {"Province": ["KA", "DL", "AP", "MP", "UP"],"Year": [2013, 2014, 2013, 2014, 2014],"Literacy": [0.2, 0.1, 0.5, 0.3, 0.5]}
print(data)
data = pd.DataFrame(data)
data

{'Province': ['KA', 'DL', 'AP', 'MP', 'UP'], 'Year': [2013, 2014, 2013, 2014, 2014], 'Literacy': [0.2, 0.1, 0.5, 0.3, 0.5]}

  Province  Year  Literacy
0       KA  2013       0.2
1       DL  2014       0.1
2       AP  2013       0.5
3       MP  2014       0.3
4       UP  2014       0.5

In [45]:
df = pd.DataFrame(data, columns=["Year", "Province" ,"Literacy"])
df

   Year Province  Literacy
0  2013       KA       0.2
1  2014       DL       0.1
2  2013       AP       0.5
3  2014       MP       0.3
4  2014       UP       0.5

In [46]:
df['nonsense'] = df.Year / df.Literacy
df

   Year Province  Literacy      nonsense
0  2013       KA       0.2  10065.000000
1  2014       DL       0.1  20140.000000
2  2013       AP       0.5   4026.000000
3  2014       MP       0.3   6713.333333
4  2014       UP       0.5   4028.000000

In [47]:
df['Serie_aligned'] = pd.Series(range(5), index=[0,1,2, 3, 4])
df

   Year Province  Literacy      nonsense  Serie_aligned
0  2013       KA       0.2  10065.000000              0
1  2014       DL       0.1  20140.000000              1
2  2013       AP       0.5   4026.000000              2
3  2014       MP       0.3   6713.333333              3
4  2014       UP       0.5   4028.000000              4

In [48]:
df2 = pd.DataFrame({"Province": ["KA", "MP", "AP"], "Population": ["100000", "200000", "300000"]})
df2

  Province Population
0       KA     100000
1       MP     200000
2       AP     300000

In [49]:
df.merge(df2)

   Year Province  Literacy      nonsense  Serie_aligned Population
0  2013       KA       0.2  10065.000000              0     100000
1  2013       AP       0.5   4026.000000              2     300000
2  2014       MP       0.3   6713.333333              3     200000

In [50]:
df3 = pd.DataFrame({"province": ["KA", "AP"], "Population": ["100000", "200000"]})
df3
df.merge(df3, right_on='province', left_on='Province')

   Year Province  Literacy  nonsense  Serie_aligned province Population
0  2013       KA       0.2   10065.0              0       KA     100000
1  2013       AP       0.5    4026.0              2       AP     200000

In [51]:
df4 = pd.DataFrame({"Province": ["KA", "DL","UP", "KL"], "Population": ["100000", "200000","300000", "50000"]})
df.merge(df4, how='outer')

     Year Province  Literacy      nonsense  Serie_aligned Population
0  2013.0       KA       0.2  10065.000000            0.0     100000
1  2014.0       DL       0.1  20140.000000            1.0     200000
2  2013.0       AP       0.5   4026.000000            2.0        NaN
3  2014.0       MP       0.3   6713.333333            3.0        NaN
4  2014.0       UP       0.5   4028.000000            4.0     300000
5     NaN       KL       NaN           NaN            NaN      50000

In [52]:
df5 = pd.DataFrame({"Province": ["KA", "UP", "KL"], "Population": ["100000", "200000", "50000"]})
print(df)
df.merge(df5, how='outer')

   Year Province  Literacy      nonsense  Serie_aligned
0  2013       KA       0.2  10065.000000              0
1  2014       DL       0.1  20140.000000              1
2  2013       AP       0.5   4026.000000              2
3  2014       MP       0.3   6713.333333              3
4  2014       UP       0.5   4028.000000              4

     Year Province  Literacy      nonsense  Serie_aligned Population
0  2013.0       KA       0.2  10065.000000            0.0     100000
1  2014.0       DL       0.1  20140.000000            1.0        NaN
2  2013.0       AP       0.5   4026.000000            2.0        NaN
3  2014.0       MP       0.3   6713.333333            3.0        NaN
4  2014.0       UP       0.5   4028.000000            4.0     200000
5     NaN       KL       NaN           NaN            NaN      50000

In [53]:
data = {"Province": ["FL", "FL", "NH", "NH", "ZH"],
        "Year": [2013, 2014, 2013, 2014, 2014],
        "Literacy": [0.2, 0.1, 0.5, 0.3, 0.5]}
print(data)
data = pd.DataFrame(data)
data

{'Province': ['FL', 'FL', 'NH', 'NH', 'ZH'], 'Year': [2013, 2014, 2013, 2014, 2014], 'Literacy': [0.2, 0.1, 0.5, 0.3, 0.5]}

  Province  Year  Literacy
0       FL  2013       0.2
1       FL  2014       0.1
2       NH  2013       0.5
3       NH  2014       0.3
4       ZH  2014       0.5

In [54]:
df = pd.DataFrame(data, columns=["Year", "Province" ,"Literacy"])
df

   Year Province  Literacy
0  2013       FL       0.2
1  2014       FL       0.1
2  2013       NH       0.5
3  2014       NH       0.3
4  2014       ZH       0.5

In [55]:
df['nonsense'] = df.Year / df.Literacy
df

   Year Province  Literacy      nonsense
0  2013       FL       0.2  10065.000000
1  2014       FL       0.1  20140.000000
2  2013       NH       0.5   4026.000000
3  2014       NH       0.3   6713.333333
4  2014       ZH       0.5   4028.000000

In [56]:
df['Serie_aligned'] = pd.Series(range(5), index=[0,1,2, 3, 4])
df

   Year Province  Literacy      nonsense  Serie_aligned
0  2013       FL       0.2  10065.000000              0
1  2014       FL       0.1  20140.000000              1
2  2013       NH       0.5   4026.000000              2
3  2014       NH       0.3   6713.333333              3
4  2014       ZH       0.5   4028.000000              4

In [57]:
df2 = pd.DataFrame({"Province": ["FL", "NH", "ZH"], "Population": ["100000", "200000", "300000"]})
df2

  Province Population
0       FL     100000
1       NH     200000
2       ZH     300000

In [58]:
df3 = pd.DataFrame({"province": ["FL", "NH"], "Population": ["100000", "200000"]})
df3
df.merge(df3, right_on='province', left_on='Province')

   Year Province  Literacy      nonsense  Serie_aligned province Population
0  2013       FL       0.2  10065.000000              0       FL     100000
1  2014       FL       0.1  20140.000000              1       FL     100000
2  2013       NH       0.5   4026.000000              2       NH     200000
3  2014       NH       0.3   6713.333333              3       NH     200000

In [59]:
df4 = pd.DataFrame({"Province": ["FL", "NH", "UT"], "Population": ["100000", "200000", "50000"]})
df.merge(df4, how='outer')

     Year Province  Literacy      nonsense  Serie_aligned Population
0  2013.0       FL       0.2  10065.000000            0.0     100000
1  2014.0       FL       0.1  20140.000000            1.0     100000
2  2013.0       NH       0.5   4026.000000            2.0     200000
3  2014.0       NH       0.3   6713.333333            3.0     200000
4  2014.0       ZH       0.5   4028.000000            4.0        NaN
5     NaN       UT       NaN           NaN            NaN      50000

In [60]:
df5 = pd.DataFrame({"Province": ["FL", "NH", "FL"], "Population": ["100000", "200000", "50000"]})
print(df)
df.merge(df5, how='outer')

   Year Province  Literacy      nonsense  Serie_aligned
0  2013       FL       0.2  10065.000000              0
1  2014       FL       0.1  20140.000000              1
2  2013       NH       0.5   4026.000000              2
3  2014       NH       0.3   6713.333333              3
4  2014       ZH       0.5   4028.000000              4

   Year Province  Literacy      nonsense  Serie_aligned Population
0  2013       FL       0.2  10065.000000              0     100000
1  2013       FL       0.2  10065.000000              0      50000
2  2014       FL       0.1  20140.000000              1     100000
3  2014       FL       0.1  20140.000000              1      50000
4  2013       NH       0.5   4026.000000              2     200000
5  2014       NH       0.3   6713.333333              3     200000
6  2014       ZH       0.5   4028.000000              4        NaN

In [61]:
a=pd.Series([np.nan,2.5,1,4,5,np.nan],index=['a','b','c','d','e','f'])
b=pd.Series(np.arange(len(a)),index=['a','b','c','d','e','f'])
a

a    NaN
b    2.5
c    1.0
d    4.0
e    5.0
f    NaN
dtype: float64

In [62]:
b

a    0
b    1
c    2
d    3
e    4
f    5
dtype: int64

In [63]:
pd.Series(np.where(pd.isnull(a), b, a), index=a.index)

a    0.0
b    2.5
c    1.0
d    4.0
e    5.0
f    5.0
dtype: float64

In [64]:
a.combine_first(b)

a    0.0
b    2.5
c    1.0
d    4.0
e    5.0
f    5.0
dtype: float64